#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer-dl]
google_data_catalog_entry_group.social_data: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/entryGroups/social_data]
google_bigquery_dataset.social_dataset: Refreshing state... [id=projects/ml-project-210100/datasets/social_dataset]
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer]
google_service_account.pubsub_social_dashboard: Refreshing state... [id=projects/ml-project-210100/serviceAccounts/pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com]
module.runner["jasso-gakuseiseikatsu-stats-importer"].google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/ml-project-210100/services/jasso-gakuseiseikatsu-stats-importer]
google_data_catalog_tag_template.data_ingestion: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer-dl]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.runner["ja-kakei-chousa-importer"].google_cloud_run_service.main will be created
  + resource "google_cloud_run_service" "main" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "ja-kakei-chousa-importer"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"        = "internal-and-cloud-load-balancing"
              + "run.googleapis.com/ingress-status" = "internal-and-cloud-load-balancing"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "10"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 1
              + serving_state         = (known after apply)
              + timeout_seconds       = 3600

              + containers {
                  + args    = []
                  + command = []
                  + image   = "us-docker.pkg.dev/cloudrun/container/hello"

                  + ports {
                      + container_port = 8080
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + timeouts {}

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>